Revit 2026 API

# UVMultiply(Double, UV) Operator

---

The product of the specified number and the specified 2-D vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator *(
	double value,
	UV right
)
```
```vb
Public Shared Operator * (
	value As Double,
	right As UV
) As UV
```
```cpp
public:
static UV^ operator *(
	double value,
	UV^ right
)
```
```fsharp
static let inline (*)
        value : float *
        right : UV  : UV
```

#### Parameters

value Double
    The value to multiply with the specified vector.
right UV
    The vector to multiply with the value.

#### Return Value

UVThe multiplied 2-D vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number. |
| ArgumentNullException | Thrown when right is . |

The multiplied vector is obtained by multiplying each coordinate of the specified vector by the specified value.

#### Reference

UV Class

Multiply Overload

Autodesk.Revit.DB Namespace